# PyCity Schools Analysis

* As a whole, schools with higher budgets, did not yield better test results. By contrast, schools with higher spending per student actually (\$645-675) underperformed compared to schools with smaller budgets (<\$585 per student).

* As a whole, smaller and medium sized schools dramatically out-performed large sized schools on passing math performances (89-91% passing vs 67%).

* As a whole, charter schools out-performed the public district schools across all metrics. However, more analysis will be required to glean if the effect is due to school practices or the fact that charter schools tend to serve smaller student populations per school. 
---

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# import packages and modifying output settings
import pandas as pd
import numpy as np
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
# Remember to enter in the cell twice for this to work

# Loading files
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Creating Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Merging datasets into one DataFrame
school_data_complete = pd.merge(student_data, school_data, how="left", 
                                on=["school_name", "school_name"])

# Removing unnecessary columns
school_data_analysis = school_data_complete[['school_name','Student ID','grade',
                                             'reading_score','math_score',
                                             'School ID', 'type','size','budget']]
# Initial overview of DataFrame
school_data_analysis.head(3)
school_data_analysis.describe()


# stylistic note: _calc and _pre are my interim step variables 
# to make the variables I need

,Student ID,reading_score,math_score,School ID,size,budget
count,39170.000000,39170.00000,39170.000000,39170.000000,39170.000000,3.917000e+04
mean,19584.500000,81.87784,78.985371,6.978172,3332.957110,2.117241e+06
std,11307.549359,10.23958,12.309968,4.444329,1323.914069,8.749987e+05
min,0.000000,63.00000,55.000000,0.000000,427.000000,2.480870e+05
25%,9792.250000,73.00000,69.000000,3.000000,1858.000000,1.081356e+06
50%,19584.500000,82.00000,79.000000,7.000000,2949.000000,1.910635e+06
75%,29376.750000,91.00000,89.000000,11.000000,4635.000000,3.022020e+06
max,39169.000000,99.00000,99.000000,14.000000,4976.000000,3.124928e+06

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [2]:
# Total number of schools
school_total = school_data_analysis['school_name'].nunique()
school_total

15

In [3]:
# Total number of students
student_total = school_data_analysis['Student ID'].count()
student_total

39170

In [4]:
# Total budget
district_total_budget = sum(school_data_analysis['budget'].unique())
district_total_budget

24649428

In [5]:
# Average math score 
avg_math_score = round(school_data_analysis['math_score'].mean(),2)
avg_math_score

78.99

In [6]:
# Average reading score
avg_read_score = round(school_data_analysis['reading_score'].mean(),2)
avg_read_score

81.88

In [7]:
# Overall passing rate 
overall_pass_rate = round(((school_data_analysis['math_score'].mean()) + 
                           (school_data_analysis['reading_score'].mean())) / 2, 2)
overall_pass_rate

80.43

In [8]:
# Calculate the percentage of students with a passing math score (70 or greater)
math_pass_calc = round(((school_data_analysis['math_score'] >= 70)
                        .value_counts("True")) * 100, 2).tolist()
math_pass = math_pass_calc[0]
math_pass

74.98

In [9]:
# Calculate the percentage of students with a passing reading score (70 or greater)
# use .tolist()
reading_pass_calc = round(((school_data_analysis['reading_score'] >= 70)
                           .value_counts("True")) * 100, 2).tolist()
reading_pass = reading_pass_calc[0]
reading_pass

85.81

In [10]:
# Create a dataframe to hold the above results, with cleaner formatting 

dataSummary1 = pd.DataFrame({'School Total': school_total, 'Student Total': student_total,
                            'District Total Budget': district_total_budget,'Average Math Score':
                            avg_math_score,'Average Reading Score': avg_read_score,
                            'Overall Passing Rate': overall_pass_rate, 'Math Passing Rate (score >= 70)':
                            math_pass, 'Reading Passing Rate (score >= 70)': reading_pass},index=[0])

In [11]:
# throwing keyword variable erros here

# dataSummary1["student_total"] = dataSummary1["student_total"].map("{:,}".format)
# dataSummary1['district_total_budget'] = dataSummary1['district_total_budget'].map("{:,}".format)
dataSummary1

,School Total,Student Total,District Total Budget,Average Math Score,Average Reading Score,Overall Passing Rate,Math Passing Rate (score >= 70),Reading Passing Rate (score >= 70)
0,15,39170,24649428,78.99,81.88,80.43,74.98,85.81

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)
  
* Create a dataframe to hold the above results

In [12]:
# Making a groupby object based on School ID and seeing 
# the initial overview of this manipulated dataset

school_summary_grouped = school_data_analysis.groupby(['School ID'])
school_summary_grouped.head(3)
school_summary_grouped.describe()

,school_name,Student ID,grade,reading_score,math_score,School ID,type,size,budget
0,Huang High School,0,9th,66,79,0,District,2917,1910635
1,Huang High School,1,12th,94,61,0,District,2917,1910635
2,Huang High School,2,12th,90,60,0,District,2917,1910635
2917,Figueroa High School,2917,10th,85,87,1,District,2949,1884411
2918,Figueroa High School,2918,12th,97,84,1,District,2949,1884411
2919,Figueroa High School,2919,12th,67,77,1,District,2949,1884411
5866,Shelton High School,5866,12th,70,91,2,Charter,1761,1056600
5867,Shelton High School,5867,10th,84,71,2,Charter,1761,1056600
5868,Shelton High School,5868,11th,95,99,2,Charter,1761,1056600
7627,Hernandez High School,7627,10th,70,88,3,District,4635,3022020
7628,Hernandez High School,7628,12th,97,93,3,District,4635,3022020
7629,Hernandez High School,7629,12th,83,81,3,District,4635,3022020
12262,Griffin High School,12262,11th,79,68,4,Charter,1468,917500
12263,Griffin High School,12263,10th,91,81,4,Charter,1468,917500
12264,Griffin High School,12264,9th,78,89,4,Charter,1468,917500
13730,Wilson High School,13730,10th,84,71,5,Charter,2283,1319574
13731,Wilson High School,13731,10th,72,87,5,Charter,2283,1319574
13732,Wilson High School,13732,10th,97,82,5,Charter,2283,1319574
16013,Cabrera High School,16013,11th,94,94,6,Charter,1858,1081356
16014,Cabrera High School,16014,9th,98,97,6,Charter,1858,1081356
16015,Cabrera High School,16015,12th,78,83,6,Charter,1858,1081356
17871,Bailey High School,17871,9th,75,59,7,District,4976,3124928
17872,Bailey High School,17872,12th,84,58,7,District,4976,3124928
17873,Bailey High School,17873,11th,79,86,7,District,4976,3124928
22847,Holden High School,22847,11th,86,92,8,Charter,427,248087
22848,Holden High School,22848,9th,91,81,8,Charter,427,248087
22849,Holden High School,22849,9th,98,93,8,Charter,427,248087
23274,Pena High School,23274,9th,91,75,9,Charter,962,585858
23275,Pena High School,23275,10th,94,76,9,Charter,962,585858
23276,Pena High School,23276,11th,98,91,9,Charter,962,585858
24236,Wright High School,24236,10th,89,72,10,Charter,1800,1049400
24237,Wright High School,24237,10th,84,93,10,Charter,1800,1049400
24238,Wright High School,24238,10th,88,88,10,Charter,1800,1049400
26036,Rodriguez High School,26036,11th,74,81,11,District,3999,2547363
26037,Rodriguez High School,26037,10th,80,86,11,District,3999,2547363
26038,Rodriguez High School,26038,11th,97,62,11,District,3999,2547363
30035,Johnson High School,30035,12th,87,87,12,District,4761,3094650
30036,Johnson High School,30036,9th,98,62,12,District,4761,3094650
30037,Johnson High School,30037,11th,89,77,12,District,4761,3094650
34796,Ford High School,34796,9th,66,94,13,District,2739,1763916
34797,Ford High School,34797,11th,68,63,13,District,2739,1763916
34798,Ford High School,34798,12th,73,59,13,District,2739,1763916
37535,Thomas High School,37535,10th,76,76,14,Charter,1635,1043130
37536,Thomas High School,37536,11th,84,82,14,Charter,1635,1043130
37537,Thomas High School,37537,9th,80,90,14,Charter,1635,1043130

          Student ID                                                    \
               count     mean          std      min       25%      50%
School ID
0             2917.0   1458.0   842.209693      0.0    729.00   1458.0
1             2949.0   4391.0   851.447297   2917.0   3654.00   4391.0
2             1761.0   6746.0   508.501229   5866.0   6306.00   6746.0
3             4635.0   9944.0  1338.153579   7627.0   8785.50   9944.0
4             1468.0  12995.5   423.919411  12262.0  12628.75  12995.5
5             2283.0  14871.0   659.189654  13730.0  14300.50  14871.0
6             1858.0  16941.5   536.502718  16013.0  16477.25  16941.5
7             4976.0  20358.5  1436.591800  17871.0  19114.75  20358.5
8              427.0  23060.0   123.408536  22847.0  22953.50  23060.0
9              962.0  23754.5   277.849780  23274.0  23514.25  23754.5
10            1800.0  25135.5   519.759560  24236.0  24685.75  25135.5
11            3999.0  28035.0  1154.556192  26036.0  27035.50  28035.0
12            4761.0  32415.0  1374.526646  30035.0  31225.00  32415.0
13            2739.0  36165.0   790.825518  34796.0  35480.50  36165.0
14            1635.0  38352.0   472.128161  37535.0  37943.50  38352.0

                              budget              ...   reading_score        \
                75%      max   count       mean   ...             75%   max
School ID                                         ...
0           2187.00   2916.0  2917.0  1910635.0   ...            90.0  99.0
1           5128.00   5865.0  2949.0  1884411.0   ...            90.0  99.0
2           7186.00   7626.0  1761.0  1056600.0   ...            92.0  99.0
3          11102.50  12261.0  4635.0  3022020.0   ...            90.0  99.0
4          13362.25  13729.0  1468.0   917500.0   ...            91.0  99.0
5          15441.50  16012.0  2283.0  1319574.0   ...            91.0  99.0
6          17405.75  17870.0  1858.0  1081356.0   ...            92.0  99.0
7          21602.25  22846.0  4976.0  3124928.0   ...            90.0  99.0
8          23166.50  23273.0   427.0   248087.0   ...            92.0  99.0
9          23994.75  24235.0   962.0   585858.0   ...            92.0  99.0
10         25585.25  26035.0  1800.0  1049400.0   ...            92.0  99.0
11         29034.50  30034.0  3999.0  2547363.0   ...            90.0  99.0
12         33605.00  34795.0  4761.0  3094650.0   ...            90.0  99.0
13         36849.50  37534.0  2739.0  1763916.0   ...            90.0  99.0
14         38760.50  39169.0  1635.0  1043130.0   ...            92.0  99.0

             size
            count    mean  std     min     25%     50%     75%     max
School ID
0          2917.0  2917.0  0.0  2917.0  2917.0  2917.0  2917.0  2917.0
1          2949.0  2949.0  0.0  2949.0  2949.0  2949.0  2949.0  2949.0
2          1761.0  1761.0  0.0  1761.0  1761.0  1761.0  1761.0  1761.0
3          4635.0  4635.0  0.0  4635.0  4635.0  4635.0  4635.0  4635.0
4          1468.0  1468.0  0.0  1468.0  1468.0  1468.0  1468.0  1468.0
5          2283.0  2283.0  0.0  2283.0  2283.0  2283.0  2283.0  2283.0
6          1858.0  1858.0  0.0  1858.0  1858.0  1858.0  1858.0  1858.0
7          4976.0  4976.0  0.0  4976.0  4976.0  4976.0  4976.0  4976.0
8           427.0   427.0  0.0   427.0   427.0   427.0   427.0   427.0
9           962.0   962.0  0.0   962.0   962.0   962.0   962.0   962.0
10         1800.0  1800.0  0.0  1800.0  1800.0  1800.0  1800.0  1800.0
11         3999.0  3999.0  0.0  3999.0  3999.0  3999.0  3999.0  3999.0
12         4761.0  4761.0  0.0  4761.0  4761.0  4761.0  4761.0  4761.0
13         2739.0  2739.0  0.0  2739.0  2739.0  2739.0  2739.0  2739.0
14         1635.0  1635.0  0.0  1635.0  1635.0  1635.0  1635.0  1635.0

[15 rows x 40 columns]

In [13]:
# # EXPERIMENTATION
# school_summary_grouped2 = school_data_analysis.groupby(['school_name','Student ID','grade','reading_score','math_score','type','size','budget']).count()
# school_summary_grouped2.head(15)

In [14]:
# INSPIRATION
# from https://ucb.bootcampcontent.com/UCB-Coding-Bootcamp
# /UCBSAN201809DATA2/blob/master/04-Pandas/2/Activities/06-Ins_GroupBy/Solved/GroupBy.ipynb

#  # Converting a GroupBy object into a DataFrame
# international_duration = pd.DataFrame(
#     grouped_international_data["duration (seconds)"].sum())
# international_duration.head(10)

In [15]:
# do I have to make individual dataframes for each variable? 
# also, how to scrape the values from one column these are all int64, cant do that trick tolist above, which had float64?

# School Name
school_name_pre = pd.DataFrame(school_summary_grouped['school_name'].value_counts())
school_name = school_name_pre.drop(['school_name'], axis=1)
school_name

Empty DataFrame
Columns: []
Index: [(0, Huang High School), (1, Figueroa High School), (2, Shelton High School), (3, Hernandez High School), (4, Griffin High School), (5, Wilson High School), (6, Cabrera High School), (7, Bailey High School), (8, Holden High School), (9, Pena High School), (10, Wright High School), (11, Rodriguez High School), (12, Johnson High School), (13, Ford High School), (14, Thomas High School)]

In [16]:
# School Type
school_type_pre = pd.DataFrame(school_summary_grouped['type'].value_counts())
school_type = school_type_pre.drop(['type'],axis=1)
school_type

Empty DataFrame
Columns: []
Index: [(0, District), (1, District), (2, Charter), (3, District), (4, Charter), (5, Charter), (6, Charter), (7, District), (8, Charter), (9, Charter), (10, Charter), (11, District), (12, District), (13, District), (14, Charter)]

In [20]:
# Total Students
total_students = pd.DataFrame(school_summary_grouped['school_name'].count())
total_students.rename(columns = {'school_name': 'Total Students'})

           Total Students
School ID
0                    2917
1                    2949
2                    1761
3                    4635
4                    1468
5                    2283
6                    1858
7                    4976
8                     427
9                     962
10                   1800
11                   3999
12                   4761
13                   2739
14                   1635

In [22]:
# Total School Budget
total_budget_pre = pd.DataFrame(school_summary_grouped['budget'].value_counts())
total_budget = total_budget_pre.drop(['budget'], axis=1)
total_budget

Empty DataFrame
Columns: []
Index: [(0, 1910635), (1, 1884411), (2, 1056600), (3, 3022020), (4, 917500), (5, 1319574), (6, 1081356), (7, 3124928), (8, 248087), (9, 585858), (10, 1049400), (11, 2547363), (12, 3094650), (13, 1763916), (14, 1043130)]

In [23]:
# Per Student Budget

# not what I wanted here, I'm tired atm
# per_student_budget = total_budget / total_students 
# per_student_budget

In [25]:
# Average Math Score
school_avg_math_score = pd.DataFrame(school_summary_grouped['math_score'].mean())
school_avg_math_score

           math_score
School ID
0           76.629414
1           76.711767
2           83.359455
3           77.289752
4           83.351499
5           83.274201
6           83.061895
7           77.048432
8           83.803279
9           83.839917
10          83.682222
11          76.842711
12          77.072464
13          77.102592
14          83.418349

In [26]:
# Average Reading Score
school_avg_reading_score = pd.DataFrame(school_summary_grouped['reading_score'].mean())
school_avg_reading_score

           reading_score
School ID
0              81.182722
1              81.158020
2              83.725724
3              80.934412
4              83.816757
5              83.989488
6              83.975780
7              81.033963
8              83.814988
9              84.044699
10             83.955000
11             80.744686
12             80.966394
13             80.746258
14             83.848930

In [ ]:
# % Passing Math

# need the appropriate conditional logic 
# use this as a guide
# school_math_pass_calc = round(((school_summary_grouped['math_score'] >= 70)
#                        .value_counts("True")) * 100, 2).tolist()

In [ ]:
# % Passing Reading
# school_reading_pass_calc

In [ ]:
# Overall Passing Rate (Average of the above two)

# use as guide 
# overall_pass_rate = round(((school_data_analysis['math_score'].mean()) + 
#                            (school_data_analysis['reading_score'].mean())) / 2, 2)
# overall_pass_rate


# school_overall_passing_rate = (school_math_pass + school_reading_pass) / 2

In [38]:
# Dataframe by school of the above data


# do dataframe merge if possible

# gotta fix the above before this part works

dataSummary2 = pd.merge(school_name, school_type, total_budget, how='outer', on='School ID')
dataSummary2
# or base off of 
# dataSummary1 = pd.DataFrame({'School Total': school_total, 'Student Total': student_total,
#                             'District Total Budget': district_total_budget,'Average Math Score':
#                             avg_math_score,'Average Reading Score': avg_read_score,
#                             'Overall Passing Rate': overall_pass_rate, 'Math Passing Rate (score >= 70)':
#                             math_pass, 'Reading Passing Rate (score >= 70)': reading_pass},index=[0])

TypeError: merge() got multiple values for argument 'how'

## Top Performing Schools (By Passing Rate)

* Sort and display the top five schools in overall passing rate

In [ ]:
# Top5Schools = school_summary_grouped.sort
# Top5Schools

## Bottom Performing Schools (By Passing Rate)

* Sort and display the five worst-performing schools

In [ ]:
# Bottom5Schools = school_summary_grouped.sort
# Bottom5Schools

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [ ]:
# Sample bins. Feel free to create your own bins.
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

## Scores by School Size

* Perform the same operations as above, based on school size.

In [ ]:
# Sample bins. Feel free to create your own bins.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

## Scores by School Type

* Perform the same operations as above, based on school type.